app/Controllers/AdminController.php

    public function dashboard()
    {
        $this->usuarios = new UsuariosModel();
        $this->clientes = new ClientesModel();
        $this->cajas = new CajasModel();
        $data['usuarios'] = $this->usuarios->where('estado', '1')->countAllResults();
        $data['clientes'] = $this->clientes->where('estado', '1')->countAllResults();
        $data['prestamos'] = $this->prestamos->where('estado', '1')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `estado` = '1'
SELECT COUNT(*) AS `numrows`
FROM `clientes`
WHERE `estado` = '1'
SELECT COUNT(*) AS `numrows`
FROM `prestamos`
WHERE `estado` = '1'