app/Controllers/CajasController.php

SELECT *
FROM `cajas`
WHERE `estado` = '1'
AND `id_usuario` = '1'
 LIMIT 1
---
    public function index()
    {
        if (!verificar('ver saldo', $this->session->permisos)) {
            return view('permisos');
            exit;
        }
        $data['caja'] = $this->cajas->where([
            'estado' => '1',
            'id_usuario' => $this->session->id_usuario
        ])->first();