app/Controllers/LoginController.php

    public function validar()
    {
        $this->reglas = [
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'El campo correo es requerido',
                    'valid_email' => 'Ingrese un correo valido',
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'El campo contraseña es requerido'
                ]
            ]
        ];
        if ($this->request->is('post') && $this->validate($this->reglas)) {

            $result = $this->usuarios
                ->select('usuarios.*, r.nombre AS rol, r.permisos')
                ->join('roles AS r', 'usuarios.id_rol = r.id')
                ->where([
                    'usuarios.correo' => $this->request->getVar('email'),
                    'usuarios.estado' => '1',
                ])->first();
---
SELECT `usuarios`.*, `r`.`nombre` AS `rol`, `r`.`permisos`
FROM `usuarios`
JOIN `roles` AS `r` ON `usuarios`.`id_rol` = `r`.`id`
WHERE `usuarios`.`correo` = 'alejandrocj2002@gmail.com'
AND `usuarios`.`estado` = '1'
 LIMIT 1