app/Controllers/UsuariosController.php

    public function profile()
    {
        $data['usuario'] = $this->usuarios->where('id', $this->session->id_usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `id` = '1'
 LIMIT 1