app/Models/CajasModel.php

SELECT `monto_inicial`
FROM `cajas`
WHERE `estado` = '1'
AND `id_usuario` = '1'
 LIMIT 1
SELECT SUM(`importe`) AS `importe`
FROM `prestamos`
WHERE `estado` = '1'
AND `id_usuario` = '1'
 LIMIT 1
SELECT `d`.`importe_cuota`, `d`.`estado`
FROM `prestamos`
JOIN `detalle_prestamos` AS `d` ON `prestamos`.`id` = `d`.`id_prestamo`
WHERE `prestamos`.`id_usuario` = '1'
AND `prestamos`.`estado` = '1'
---
    public function calcularMovimientos($id_usuario) {
        $prestamos = new PrestamosModel();
        $inicial = $this->select('monto_inicial')->where([
            'estado' => '1',
            'id_usuario' => $id_usuario
        ])->first();

        $incialSaldo = (empty($inicial)) ? 0 : $inicial['monto_inicial'];

        $egreso = $prestamos->selectSum('importe')->where([
            'estado' => '1',
            'id_usuario' => $id_usuario
        ])->first();

        $ingresos = $prestamos
            ->select('d.importe_cuota, d.estado')
            ->join('detalle_prestamos AS d', 'prestamos.id = d.id_prestamo')
            ->where([
                'prestamos.id_usuario' => $id_usuario,
                'prestamos.estado' => '1'
            ])->findAll();